[
  {
    "edu_1": "England pace bowler Jofra Archer could play in this year's T20 World Cup but",
    "edu_2": "will not play test cricket until 2025,",
    "label": 2
  },
  {
    "edu_1": "England pace bowler Jofra Archer could play in this year's T20 World Cup but will not play test cricket until 2025",
    "edu_2": "according to England managing director Rob Key.",
    "label": 1
  },
  {
    "edu_1": "England pace bowler Jofra Archer could play in this year's T20 World Cup but will not play test cricket until 2025, according to England managing director Rob Key.",
    "edu_2": "The 29-year-old has not played for England in any format since March 2023 because of an elbow injury.",
    "label": 0
  },
  {
    "edu_1": "Archer's England career has been plagued by injuries,",
    "edu_2": "and he has not played a test match since the tour of India in 2021.",
    "label": 0
  },
  {
    "edu_1": "Jofra's been out at Sussex's pre-season in India and bowled quickly out there.",
    "edu_2": "He bowled really well.",
    "label": 0
  },
  {
    "edu_1": "He's now just gone back to the Caribbean, where he will play a little bit of club cricket, stuff like that.",
    "edu_2": "It's all about getting himself ready for that T20 World Cup.",
    "label": 3
  },
  {
    "edu_1": "He'll hopefully play the Pakistan T20 series (in May),",
    "edu_2": "but it's all fingers crossed with Jofra at the moment.",
    "label": 2
  },
  {
    "edu_1": "New Zealand is expecting big crowds",
    "edu_2": "when it hosts England in Tests in Christchurch, Wellington, and Hamilton in November and December, New Zealand Cricket (NZC) said on Tuesday.",
    "label": 0
  },
  {
    "edu_1": "NZC chief executive Scott Weenink said there were already indications",
    "edu_2": "that the three matches against Brendon McCullum's team would attract the same sort of bumper attendances witnessed for the two home Tests against Australia in February and March.",
    "label": 0
  },
  {
    "edu_1": "The first Test at Christchurch's Hagley Oval will begin on Nov. 28 with the Basin Reserve in Wellington hosting the second from Dec. 6-10.",
    "edu_2": "The series wraps up at Hamilton's Seddon Park from Dec. 14-18. The three clashes will form part of the World Test Championship, which New Zealand won in its inaugural edition.",
    "label": 3
  },
  {
    "edu_1": "New Zealand are currently third in the rankings",
    "edu_2": "with England ninth and last.",
    "label": 2
  },
  {
    "edu_1": "Australia's Glenn Maxwell will take an indefinite mental and physical break from the IPL",
    "edu_2": "after struggling for form with Royal Challengers Bengaluru.",
    "label": 0
  },
  {
    "edu_1": "The big-hitting all-rounder has scored just 32 with the bat in six games",
    "edu_2": "and skipped the defeat on Monday in a record run-fest against Sunrisers Hyderabad.",
    "label": 0
  },
  {
    "edu_1": "It was Bengaluru's sixth defeat in seven matches",
    "edu_2": "and Faf du Plessis's side are bottom of the 10-team table.",
    "label": 3
  },
  {
    "edu_1": "Maxwell, who will be key for Australia at the T20 World Cup in June,",
    "edu_2": "was one of the first cricketers to recognise mental health issues",
    "label": 1
  },
  {
    "edu_1": "Maxwell, who will be key for Australia at the T20 World Cup in June, was one of the first cricketers to recognise mental health issues",
    "edu_2": "and took a break from international cricket in 2019.",
    "label": 1
  },
  {
    "edu_1": "Rain delayed the toss in the T20 World Cup semi-final between defending champions England and India in Guyana on Thursday.",
    "edu_2": "A pre-match downpour had stopped by the time the toss should have taken place at 1400 GMT",
    "label": 0
  },
  {
    "edu_1": "Rain delayed the toss in the T20 World Cup semi-final between defending champions England and India in Guyana on Thursday. A pre-match downpour had stopped by the time the toss should have taken place at 1400 GMT",
    "edu_2": "but the pitch and square remained fully covered.",
    "label": 2
  },
  {
    "edu_1": "Wednesday's first semi-final in Trinidad, in which South Africa hammered Afghanistan by nine wickets,",
    "edu_2": "had a reserve day set aside in the event of rain.",
    "label": 0
  },
  {
    "edu_1": "had a reserve day set aside in the event of rain.",
    "edu_2": "But the England v India game, taking place during a traditionally wet period of the year,",
    "label": 2
  },
  {
    "edu_1": "But the England v India game, taking place during a traditionally wet period of the year,",
    "edu_2": "has only 250 minutes of extra time set aside to ensure a result.",
    "label": 3
  },
  {
    "edu_1": "India have yet to lose a match at the 20-over tournament",
    "edu_2": "but the only Test side that England have defeated on their way to the last four are co-hosts the West Indies.",
    "label": 2
  },
  {
    "edu_1": "By becoming the first South African men's captain to reach a World Cup final, Aiden Markram has proved",
    "edu_2": "that he and his men are cut from a different cloth.",
    "label": 4
  },
  {
    "edu_1": "It's a personal and individual motivation that you get to a final, to earn the opportunity to hopefully lift the trophy.",
    "edu_2": "But we all understand (as a team) this game and how it works and how things can go for you, things can go against you, and you take that in your stride.",
    "label": 3
  },
  {
    "edu_1": "With measure and poise at the post-match press conference after their victory against Afghanistan,",
    "edu_2": "and reflecting on just another game of cricket",
    "label": 0
  },
  {
    "edu_1": "you'd never think Aiden Markram, moments after an ICC Men's T20 World Cup semi-final,",
    "edu_2": "had just become the first South Africa men's captain to take the Proteas to the promised land of a World Cup final.",
    "label": 5
  },
  {
    "edu_1": "Sri Lanka head coach Chris Silverwood has resigned from his position",
    "edu_2": "in order to spend more time with his family,",
    "label": 6
  },
  {
    "edu_1": "Sri Lanka head coach Chris Silverwood has resigned from his position in order to spend more time with his family",
    "edu_2": "the country's cricket board said on Thursday.",
    "label": 1
  },
  {
    "edu_1": "The 49-year-old Englishman took charge of Sri Lanka in 2022 following his stint as England head coach",
    "edu_2": "and guided them to the Twenty20 Asia Cup title and the final of the 50-overs Asia Cup the following year.",
    "label": 0
  },
  {
    "edu_1": "The 49-year-old Englishman took charge of Sri Lanka in 2022 following his stint as England head coach and guided them to the Twenty20 Asia Cup title and the final of the 50-overs Asia Cup the following year.",
    "edu_2": "However, they had a disappointing run in the 50-overs World Cup in India last year",
    "label": 2
  },
  {
    "edu_1": "However, they had a disappointing run in the 50-overs World Cup in India last year",
    "edu_2": "finishing ninth of 10 teams after seven defeats in nine matches.",
    "label": 0
  },
  {
    "edu_1": "However, they had a disappointing run in the 50-overs World Cup in India last year, finishing ninth of 10 teams after seven defeats in nine matches.",
    "edu_2": "They also failed to progress to the Super Eight stage of the ongoing T20 World Cup.",
    "label": 0
  },
  {
    "edu_1": "Being an international coach means long periods away from loved ones.",
    "edu_2": "I feel it is now time for me to return home and spend some quality time together, Silverwood said.",
    "label": 0
  },
  {
    "edu_1": "After lengthy conversations with my family and with a heavy heart,",
    "edu_2": "I feel it is now time for me to return home and spend some quality time together, Silverwood said.",
    "label": 6
  },
  {
    "edu_1": "Bangladesh Cricket Board's (BCB) High Performance (HP) unit will embark on their tour of Australia in July",
    "edu_2": "to play two four-day games followed by one-day and T20 series.",
    "label": 0
  },
  {
    "edu_1": "HP will begin their tour with two four-day games against Pakistan Shaheens,",
    "edu_2": "the first slated for July 19 and the second on July 26 in Darwin.",
    "label": 0
  },
  {
    "edu_1": "The team are set to depart for Australia on July 13.",
    "edu_2": "Following the red-ball format, Bangladesh A will play a fifty-over tri-series with Pakistan Shaheens and Northern Territory of Australia.",
    "label": 3
  },
  {
    "edu_1": "The team are set to depart for Australia on July 13. Following the red-ball format, Bangladesh A will play a fifty-over tri-series with Pakistan Shaheens and Northern Territory of Australia.",
    "edu_2": "The tour will conclude for Bangladesh A with the nine-team Top End T20 series.",
    "label": 0
  },
  {
    "edu_1": "The tournament will feature Pakistan's Shaheen along with some leading Big Bash outfits",
    "edu_2": "such as Perth Scorchers, Melbourne Renegades, Melbourne Stars, Tasmania, Adelaide Strikers, and ACT Comets.",
    "label": 7
  },
  {
    "edu_1": "Australia captain Mitchell Marsh described Gulbadin Naib's alleged antics during the tense World Cup match against Bangladesh",
    "edu_2": "as one of the funniest things I've ever seen on a cricket field, adding that he was almost in tears of laughter over the incident.",
    "label": 7
  },
  {
    "edu_1": "as one of the funniest things I've ever seen on a cricket field",
    "edu_2": "adding that he was almost in tears of laughter over the incident.",
    "label": 0
  },
  {
    "edu_1": "During the crucial final overs of Bangladesh's chase,",
    "edu_2": "with rain threatening to end the match prematurely and send Australia through,",
    "label": 0
  },
  {
    "edu_1": "Naib dramatically collapsed on the field, clutching his leg.",
    "edu_2": "This occurred shortly after television cameras caught England coach Jonathan Trott",
    "label": 3
  },
  {
    "edu_1": "in charge of Bangladesh, urging his players to slow down the flow of the game",
    "edu_2": "due to the DLS target coming into play.",
    "label": 6
  },
  {
    "edu_1": "I was almost in tears laughing",
    "edu_2": "and at the end of the day it had no bearing on the game.",
    "label": 5
  },
  {
    "edu_1": "So we can laugh about it now ? but gee it was funny.",
    "edu_2": "It was outstanding,",
    "label": 0
  },
  {
    "edu_1": "So we can laugh about it now ? but gee it was funny. It was outstanding",
    "edu_2": "Marsh said of the incident as he watched the match on TV with his teammates.",
    "label": 1
  },
  {
    "edu_1": "With record attendance, website and app hits,",
    "edu_2": "ICC Men's T20 World Cup 2024 has witnessed an unprecedented increase in interest across platforms.",
    "label": 0
  },
  {
    "edu_1": "The USA leg of the Men's T20 World Cup saw riveting cricketing action including the home team's stunning upset win in Dallas",
    "edu_2": "and an incredible India vs Pakistan nail-biter in New York.",
    "label": 0
  },
  {
    "edu_1": "And the cricketing fever managed to reach the fans in the USA",
    "edu_2": "who turned out in extraordinary numbers for the action-packed first round of the ICC Men's T20 World Cup.",
    "label": 6
  },
  {
    "edu_1": "In the USA alone, 190,000 fans attended matches",
    "edu_2": "that captivated the country and set the stage for cricket's continued growth in North America.",
    "label": 0
  },
  {
    "edu_1": "Bangladesh lacked vitality in the Powerplay against Australia yesterday when the chance came to bat first at the Sir Vivian Richards Stadium",
    "edu_2": "one of the best batting tracks on offer in the ongoing edition.",
    "label": 0
  },
  {
    "edu_1": "The top-order's rudderless performances throughout the group stage was enough evidence",
    "edu_2": "for the team management to work out a different approach",
    "label": 6
  },
  {
    "edu_1": "for the team management to work out a different approach",
    "edu_2": "but they opted for one that did not work.",
    "label": 2
  },
  {
    "edu_1": "In what appeared to be at least a 160-170 wicket,",
    "edu_2": "Bangladesh looked past putting early pressure on Australia's bowling attack.",
    "label": 0
  },
  {
    "edu_1": "Bangladesh had in fact wanted to keep wickets in hand for the last six overs of the innings",
    "edu_2": "but they couldn't manage to get the momentum they wanted",
    "label": 2
  },
  {
    "edu_1": "but they couldn't manage to get the momentum they wanted",
    "edu_2": "as wickets fell frequently.",
    "label": 6
  }
]